// Baza podataka ulica i rejona kojima pripadaju

const allDistricts = [
  {
    label: 'Алтина лева 1',
    streets: [
      'Угриновачка 212',
      'Епископа Николаја',
      'Оскара Давича',
      'Мусорског',
      'Александра Поповића',
      'Мирослава Антића',
      'Зуке Џумхура',
      'Љиљане Крстић',
      'Виктора Старчића',
      'Стојана Дечермића',
      'Серантесова',
      'Ташка Начића',
      'Јоза Лауренчића',
      'Зире Адамовић',
      'Жике Павловића',
      'Гордане Косановић',
      'Слободана Ђурића',
      'Југа Гризеља',
      'Раденка Мишевића',
      'Слободана Глумца',
      'Џесија Овенса',
      'Абебе Бикиле',
      'Јустина Поповића',
    ]
  },
  {
    label: 'Алтина десна 2',
    streets: [
      'Борхесова',
      'Кортесарова',
      'Александра Петровића',
      'Акира Куросаве',
      'Константина Кавафија',
      'Григорија Божовића',
      'Амадова',
      'Емила Златопека',
      'Мије Алексића',
      'Епископа Сергеја',
      'Симона Боливара',
      'Дијега Ривере',
      'Светомира Ђукића',
      'Ђуре Курепе',
      'Jovana Raškovića',
      'Pružni put',       
      'Vase Čubrilovića'
    ]
  },
  {
    label: 'Угриновачки Пут',
    streets: [
      'Ратарски пут 1-35',
      'Угриновачки пут',
      'Угриновачки пут 1. део',
      'Угриновачки пут  2.део',
      'Угриновачки пут  4. део',
      'Угриновачки пут  6. део',
      'Угриновачки пут  9. део',
      'Угриновачки пут   11.део',
      'Угриновачки пут   13 . део',
      'Угриновачки пут  15. део',
      'Угриновачки пут  16 . део',
      'Угриновачки пут  20. део',
      'Угриновачки пут  26. део',
      'Угриновачки пут  27. део',
      'Драгише Васића',
      'Симеона Кончаревича',
      'Чедомира Крстића',
      'Драгачевских трубача',  
      'Угриновачки пут  7. део',
      'Угриновачки пут  8. део',
      'Угриновачки пут  9. део',
      'Угриновачки пут 10. део',
      'Угриновачки пут 12. део',
      'Угриновачки пут 14. део',
      'Угриновачки пут  19. део',
      'Угриновачки пут  22. део',
      'Угриновачки пут  23. део',
      'Угриновачки пут  24. део',
      'Угриновачки пут  25. део',
      'Угриновачки пут  30. део',
      'Угриновачки пут  31. део',
      'Угриновачки пут  32. део',
      'Угриновачки пут  33. део',
      'Угриновачки пут  34. део',
      'Угриновачки пут  35. део',
      'Угриновачки пут  37. део',
      'Угриновачки пут  39. део',
      'Угриновачки пут  41. део',
      'Угриновачки пут  42. део',
      'Угриновачки пут  43. део'
    ]
  },
  {
    label: 'Земун Поље',
    streets: [
      'Јурија Ракитина',
      'Елија Финција',
      'Војничка',
      'Гојка Николиша',
      'Акробате Алексића',
      'Глинска',
      'Милана Младеновића',
      'Слободана Бајића',
      'Браће Мицић',
      'Влајка Ђурановића',
      'Томице Поповића',
      'Влајка Ђурановића',
      'Вијетнамска',
      'Фрање Крча',
      'Бертранда Расела',
      'Бургерових',
      'Мартина Лутера Кинга',
      'Синише Богнера',
      'Пере Косорића',
      'Михајла Пупина',
      'Олге Петров', 
      'Марка Милановића',
      'Шандора Мајора',
      'Беже Албахари', 
      'Алфреда Нобела',
      'Псачка',
      'Јарослава Чермака',
      'Матејичка',
      'Србичка',
      'Јазачка',
      'Јована Туцакова',
      'Дреничка', 
      'Ранилушка',
      'Љуботенска',
      'Троношка',
      'Војловачка',
      'Ђорђа Лобачева',
      'Дејана Дубајића',
      'Јеремије Станојевића',
      'Негована Љубинковића',
      'Живојина Ћулума',
      'Жике Месаровића',
      'Антона Клеменчића',
      'Корбизијеова',
      'Добровољних ватрогасаца',
      'Девалдових',  
      'Душана Мађарчића Корчагина',
      'Браће Крњешевац',
      'Анке Матић',
      'Љубомира Живковића Шпанца',
      'Триве Витасовића',
    ]
  },
  {
    label:'Плави Хоризонти',
    streets: [
      'Курирска',
      'Никиначка',
      'Летенка',
      'Бечменска',
      'Лугарска',
      'Дечка',
      'Банстолска',
      'Стојана Марковића',
      'Страхиње Петровића',
      'Др Борисава Вујадиновића',
      'Алимпија Васиљевића',
      'Атанасија Николића',
      'Исидора Стојановића',
      'Мире Папић',
      'Купински кут',
      'Јована Бошковића',
      'Косте Бранковића',
      'Константина Јовановића',
      'Владимира Јовановића',
      'Рајка Лесјанина',
      'Косте Алковића',
      'Косте Цукића',
      'Милана Недељковића',
      'Јована Бошковића',
    ]
  },
  {
    label: 'Војни Пут',
    streets: [
      'Крајишка',
      'Војни пут 1. део 405-999',
      'Војни пут 2. део 143a-316',
      'Војводе Чупића',
      'Сопотска',
      'Војводе Катића',
      'Др Косановића',
      'Ајдановачка',
      'Александра Стојановића',
      'Колубарске битке',
      'Алексе Маркишића',
      'Војислава Ракоњца',
      'Добановачки пут',
      'Добановачки пут 1. део',
      'Добановачки пут 2. део',
      'Добановачки пут 3. део',
      'Добановачки пут 4.део',
    ]
  },
  {
    label: 'Галеника лева',
    streets: [
      'Мала Пруга 2-18',
      'Светозара Папића',
      'Јосипа Шенера',
      'Сестара Страин',
      'Вере Димитријевић',
      'Петра Јововића',
      'Емилије Јакшић',
      'Сестара Страин',
      'Браће Фогл',
      'Николе Рибарића',
      'Божице Дивнић',
      'Милице Шуваковић',
      'Косте Драгичевића',
      'Илије Рогулића',
      'Миленка Веркића',
      'Лазара Мамузића',
      'Јована Стојисављевића',
    ]
  },
  {
    label: 'Галеника десна',
    streets: [
      'Дунавских вирова',
      'Цара Душана 207-999',
      'Цара Душана 268-888',
      'Ауто Пут за Нови Сад 2 ',
      'Ратарски Пут 35-999',
    ]
  }
]

// Elements
const resultsContent = document.querySelector('.results__content')
const searchInput = document.getElementById('search')

// Functions
const createElement = (tag = 'div', classes, text, data) => {
  const el = document.createElement(tag)
  if (text) {
    el.innerText = text
  }
  if (data) {
    el.dataset.street = data
  }
  el.classList.add(...classes)
  return el
}

function sortByDistrict(a, b) {
  if (a.label < b.label) {
    return -1;
  }
  if (a.label > b.label) {
    return 1;
  }
  return 0;
}

// const sortByDistrict = (a,b) => {
//   a.district - b.district
// }

const handleChange = (e) => {
  const searchValue = e.target.value.toUpperCase()

  districtElements.forEach(item => {
    if (searchValue === '' || item.dataset.street.includes(searchValue)) {
      item.style.display = 'flex'
    } else {
      item.style.display = 'none'
    }
  })
}

const createItems = (items) => {
  items.forEach(item => {
    item.streets.forEach(currentStreet => {
      const streetToUppercase = currentStreet.toUpperCase()
      const wrapper = createElement('div', ['districts__items-wrapper'], undefined, streetToUppercase)
      const street = createElement('span', ['districts__item', 'districts__item--street'], currentStreet)
      const district = createElement('span', ['districts__item', 'districts__item--district-number'], item.label)
      wrapper.appendChild(street)
      wrapper.appendChild(district)
      resultsContent.append(wrapper)
    })
  })
}

// Event listeners
searchInput.addEventListener('input', handleChange)
console.log(allDistricts)
// Prodji kroz sve rejone, dodaj svakoj ulici njen rejon radi lakse pretrage posle
// const districts = [].concat(...allDistricts.map(district => {
//   return district.streets.map(district => {
//     return { street: district.street, district: district.label}
//   })
// }))
// Sortiraj prema rejonu i ispisi sve
allDistricts.sort(sortByDistrict)
createItems(allDistricts)
const districtElements = document.querySelectorAll('.results__content .districts__items-wrapper')